#!/usr/bin/env python3
print("*********************")
print("*运势缘分量子力学测试*")
print("*********************")
print("想知道你的运势吗？")
print("想知道ta对你心动吗？")
print("量子力学最新研究成果来帮你！")
print("编辑\"姓名+ta的姓名\"，例如\"郭靖+黄蓉\"就能知晓！")
name = input("请输入您姓名+ta的姓名：")
if name == '郭文昕+罗树凯':
    print("hi，宝贝，")
    print("你的可爱指数是：★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★")
    print("你的聪明指数是：★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★")
    print("你的性感指数是：★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★")
    print("您最近的运势是：★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★")
    print("ta对您的爱爱指数是：♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥")
    print("恭喜您！你们锁锁锁锁啦！")
else:
    print("有事吗弟弟？")